#+STARTUP: content indent

** Overview

- [[https://support.rstudio.com/hc/en-us/articles/218004217-Building-R-from-source][Building R from source@RStudio]]
- [[https://stats.biopapyrus.jp/r/devel/r-install.html][ソースコードをコンパイルして R をインストール@biostatistics]]

- [[https://cran.ism.ac.jp/][CRAN]] から必要なバージョンのソースをダウンロード
- =./configure --help= で利用可能なオプションを確認

- tex 関連のエラーが出る可能性あり
  - mac の場合は、texinfo の PATH を通す
- cairo の機能が skipped になるケースがある

#+begin_src shell :eval never

# anyenv を利用する場合は、以下のようにインストール先を指定
# --enable-R-shlib は R Studio Server から R shared library にアクセスするために必要
./configure --prefix=/home/shun/.anyenv/envs/Renv/versions/4.0.0 --enable-R-shlib
--with-blas
--with-lapack

# mac
# ./configure --prefix=/Users/shun/.anyenv/envs/Renv/versions/4.0.0 --enable-R-shlib

make
make install
#+end_src

#+RESULTS:

- 有効な機能を確認
#+begin_src R :results output
capabilities()
#+end_src

#+RESULTS:
:        jpeg         png        tiff       tcltk         X11        aqua 
:        TRUE        TRUE        TRUE        TRUE        TRUE       FALSE 
:    http/ftp     sockets      libxml        fifo      cledit       iconv 
:        TRUE        TRUE        TRUE        TRUE       FALSE        TRUE 
:         NLS     profmem       cairo         ICU long.double     libcurl 
:        TRUE       FALSE        TRUE        TRUE        TRUE        TRUE 

*** Overview

参考
- [[https://csantill.github.io/RPerformanceWBLAS/][Improving R Perfomance by installing optimized BLAS/LAPACK libraries]]
  - ベンチマーク比較があり詳細
- [[https://qiita.com/hoxo_m/items/aa04b9d3d7a32cb6a1a3][OpenBLAS で R を高速化 - Qiita]]
  - BLAS を OpenBLAS に切り替えて速度向上を図る
- [[https://www.r-bloggers.com/why-is-r-slow-some-explanations-and-mklopenblas-setup-to-try-to-fix-this/][Why is R slow? some explanations and MKL/OpenBLAS setup to try to fix this | ...]]
- [[https://blog.revolutionanalytics.com/2015/10/edge-cases-in-using-the-intel-mkl-and-parallel-programming.html][Edge cases in using the Intel MKL and parallel programming (Revolutions)]]
  - BLAS ライブラリが並列化パッケージと干渉してしまう場合のコア数制限方法
 
- BLAS (Basic Linear Algebra Subprograms)
  - 行列計算用のライブラリ
  - Ubuntu パッケージは =libblas3=

- LAPACK
  - Fortran 製
  - Ubuntu パッケージは =liblapack3=
  - 連立一次方程式・最小二乗法・固有値問題・特異値問題
  - LU, Cholesky, QR, SVD, Schur, generalized Schur

- 選択肢
  - OpenBLAS
  - AtlasBLAS
  - GotoBLAS
  - Intel MKL: Intel CPU では当然速い
    - [[https://software.intel.com/content/www/us/en/develop/articles/installing-intel-free-libs-and-python-apt-repo.html][Installing Intel® Performance Libraries and Intel® Distribution for...]] 
    - [[https://qiita.com/f0o0o/items/d79971215fd37c3a5d36][Intel MKL を apt からインストールする - Qiita]]
    - [[http://dirk.eddelbuettel.com/blog/2018/04/15/][Thinking inside the box]]
  - Microsoft R Open
- 選択肢 (Mac)
  - veclib

- 利用方法
  - R を =--with-blas= でビルド
  - =update-alternatives= で利用するライブラリを選択

- 現在の設定を確認
#+begin_src R :exports both :results output
sessionInfo() 
#+end_src

#+RESULTS:
#+begin_example
R version 3.6.3 (2020-02-29)
Platform: x86_64-pc-linux-gnu (64-bit)
Running under: Ubuntu 18.04.4 LTS

Matrix products: default
BLAS:   /home/shun/.anyenv/envs/Renv/versions/3.6.3/lib/R/lib/libRblas.so
LAPACK: /home/shun/.anyenv/envs/Renv/versions/3.6.3/lib/R/lib/libRlapack.so

locale:
 [1] LC_CTYPE=en_US.UTF-8       LC_NUMERIC=C              
 [3] LC_TIME=en_US.UTF-8        LC_COLLATE=C              
 [5] LC_MONETARY=en_US.UTF-8    LC_MESSAGES=C             
 [7] LC_PAPER=en_US.UTF-8       LC_NAME=C                 
 [9] LC_ADDRESS=C               LC_TELEPHONE=C            
[11] LC_MEASUREMENT=en_US.UTF-8 LC_IDENTIFICATION=C       

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

loaded via a namespace (and not attached):
[1] compiler_3.6.3
#+end_example

